cats/app/controllers/cats_controller.rb

      def index
         @cats = Cat.all
---
SELECT  "cats".* FROM "cats" WHERE (create) LIMIT $1  [["LIMIT", 1]]