cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE (create) LIMIT $1  [["LIMIT", 1]]
---
      def show
         @cat = Cat.find_by(params[:id])